import styles from "./DeliveryPaymentComponent.module.css";

export default function DeliveryPaymentComponent() {
  return (
    <>
      <h2>Доставка оплата</h2>
      <div className={styles.container}>
        <div className={styles.gridColumn}>
          <h3>КУР'ЄРСЬКА ДОСТАВКА </h3>
          <p>Доставка здійснюється по місту Київ.</p>
          <h4>Як зробити замовлення</h4>
          <p>Час доставки з 10.30 до 20.30</p>
          <p>Замовлення товару можна зробити будь-яким зручним способом:</p>
          <p>- за номером телефону</p>
          <p>- на сайті</p>
          <h4>
            <i>
              ВАЖЛИВО! Алкогольні напої можуть бути придбані тільки особами
              котрим є 18+
            </i>
          </h4>
          <h3>Спосіб оплати</h3> 
          - готівкою при доставці кур'єру 
          <h3>Умови доставки </h3>
          - мінімальна вартість замовлення від 250 грн. 
          - вартість доставки 99
          грн. 
          - час доставки до 120 хв. 
          
          <h3>Для підтвердження замовлення на сайті</h3>,
          протягом 5 хв з вами зв'яжеться наш оператор. ВАЖЛИВО! На сайті не
          вказано вартість тари і пакету. При підтвердженні замовлення, її
          уточнить оператор.
        </div>
        <p>1</p>
      </div>
    </>
  );
}
