import { useHistory } from "react-router-dom";
import styles from "./UserAgreement.module.css";

export default function UserAgreement() {
  const history = useHistory();
  return (
    <div className={styles.container}>
      <button onClick={history.goBack}>Повернутися назад</button>
      <br />
      <br />
      <br />
      <br />
      <br />
      <p>ПОЛОЖЕННЯ ПРО ОБРОБКУ І ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ</p>

      <p> 1. Загальні положення.</p>

      <p>
        {" "}
        1.1. Ця положення про обробку і захист персональних даних складено
        відповідно до всіх необхідних вимог Закону України «Про захист
        персональних даних» та інших нормативно-правових актів та визначає
        порядок отримання, збору, накопичення, зберігання, обробки,
        використання, забезпечення захисту і розкриття персональних даних
        (надалі – «Дані» та/або «Персональні дані») за допомогою веб-сайту:
        https://www.pyvnagavan.com/ (надалі – «Сайт» або «Інтернет-магазин»)
        та/або пов'язаних з ними послуг та інструментів, які вживає
        ________________________ (далі – Оператор).
      </p>

      <p>
        {" "}
        1.2. Оператор ставить своєю найважливішою метою та умовою здійснення
        своєї діяльності дотримання прав та свобод людини та громадянина при
        обробці його персональних даних, у тому числі захисту прав на
        недоторканність приватного життя, особисту та сімейну таємницю.
      </p>

      <p>
        {" "}
        1.3. Ця положення про обробку і захист персональних (далі – Положення)
        застосовується до всієї інформації, яку Оператор може отримати про
        відвідувачів веб-сайту https://www.pyvnagavan.com/.
      </p>

      <p>
        {" "}
        1.4. Здійснивши реєстрацію на веб-сайті https://www.pyvnagavan.com/
        та/або починаючи використання Інтернет-магазину, або при спробі оформити
        замовлення без попередньої реєстрації, Користувач (Покупець) надає
        дозвіл та однозначну згоду на обробку його персональних даних на умовах
        та в порядку, що викладені нижче, а також підтверджує ознайомлення з цим
        Положенням, його прийняття та згоду з його змістом.
      </p>

      <p>
        {" "}
        1.5. На Сайті можуть бути посилання на інші веб-сайти (виключно в
        інформаційних цілях). При переході за посиланням на інші веб-сайти дія
        цього Положення на такі сайти не поширюватиметься. У зв'язку з чим,
        Оператор рекомендує ознайомитися з політикою в сфері конфіденційності та
        персональних даних кожного сайту перед тим, як передавати персональні
        дані, за якими особа може бути ідентифікована.{" "}
      </p>

      <p>
        {" "}
        1.6. Дане Положення обов’язкове для застосування відповідальною особою
        та співробітниками Інтернет-магазину, які безпосередньо здійснюють
        обробку та/або мають доступ до персональних даних у зв’язку з виконанням
        своїх службових обов’язків.
      </p>

      <p> 2. Основні поняття, що використовуються у Положенні.</p>

      <p>
        {" "}
        2.1. Автоматизована обробка персональних даних – обробка персональних
        даних за допомогою засобів обчислювальної техніки.
      </p>

      <p>
        {" "}
        2.2. Блокування персональних даних – тимчасове припинення обробки
        персональних даних (крім випадків, якщо обробка необхідна для уточнення
        персональних даних).
      </p>

      <p>
        {" "}
        2.3. Веб-сайт – сукупність графічних та інформаційних матеріалів, а
        також програм для ЕОМ та баз даних, що забезпечують їх доступність у
        мережі інтернет за мережевою адресою https://www.pyvnagavan.com/.
      </p>

      <p>
        {" "}
        2.4. Інформаційна система персональних даних – сукупність персональних
        даних, що містяться в базах даних, і інформаційних технологій та
        технічних засобів, що забезпечують їх обробку.
      </p>

      <p>
        {" "}
        2.5. Знеособлення персональних даних — дії, у яких неможливо визначити
        без використання додаткової інформації належність персональних даних
        конкретному Користувачеві чи іншому суб'єкту персональних даних.
      </p>

      <p>
        {" "}
        2.6. Обробка персональних даних – будь-яка дія (операція) або сукупність
        дій (операцій), що здійснюються з використанням засобів автоматизації
        або без використання таких засобів з персональними даними, включаючи
        збирання, запис, систематизацію, накопичення, зберігання, уточнення
        (оновлення, зміну), вилучення, використання, передачу (розповсюдження,
        надання, доступ), знеособлення, блокування, видалення, знищення
        персональних даних.
      </p>

      <p>
        {" "}
        2.7. Оператор – юридична або фізична особа, що самостійно або спільно з
        іншими особами організовують та (або) здійснюють обробку персональних
        даних, а також визначають цілі обробки персональних даних, склад
        персональних даних, що підлягають обробці, дії (операції), що
        здійснюються із персональними даними. Оператором є __________________
        (код ЄДРПОУ: _______________, адреса: вул. Пивоварів, 1, м. Київ,
        Україна, 03056).
      </p>

      <p>
        {" "}
        2.8. Персональні дані – будь-яка інформація, що відноситься прямо або
        опосередковано до певного або визначеного Користувача веб-сайту
        https://www.pyvnagavan.com/.
      </p>

      <p>
        {" "}
        2.9. Під Користувачем (Покупцем, споживачем) в цьому Положенні маються
        на увазі будь-яка фізична та/або юридична особа, яка має доступ до
        Інтернет-магазину і використовує його функціональність і сервіси.
      </p>

      <p>
        {" "}
        2.10. Надання персональних даних – дії, створені задля розкриття
        персональних даних певній особі чи певному колу осіб.
      </p>

      <p>
        {" "}
        2.11. Поширення персональних даних – будь-які дії, спрямовані на
        розкриття персональних даних невизначеному колу осіб (передача
        персональних даних) або на ознайомлення з персональними даними
        необмеженого кола осіб, зокрема оприлюднення персональних даних у
        засобах масової інформації, розміщення в інформаційно-телекомунікаційних
        мережах або надання доступу до персональних даних будь-яким іншим
        способом.
      </p>

      <p>
        {" "}
        2.13. Знищення персональних даних – будь-які дії, внаслідок яких
        персональні дані знищуються безповоротно з неможливістю подальшого
        відновлення змісту персональних даних в інформаційній системі
        персональних даних та (або) знищуються матеріальні носії персональних
        даних.
      </p>

      <p> 3. Склад та зміст Персональних даних.</p>

      <p> 3.1. Оператор може обробляти такі персональні дані Користувача:</p>

      <p> - Електронні адреси;</p>

      <p> - Номери телефонів;</p>

      <p> - ПІБ;</p>

      <p> - Адреса доставки;</p>

      <p>
        {" "}
        3.2. Також на Сайті відбувається збір та обробка знеособлених даних про
        відвідувачів (в т. ч. файлів cookie) за допомогою сервісів
        інтернет-статистики (Гугл Аналітика та інші).
      </p>

      <p>
        {" "}
        3.3. Користувачі несуть відповідальність за всю інформацію, що
        розміщується ними в загальнодоступних облікових записах. Користувач
        повинен усвідомити всі ризики, пов'язані з тим, що він оприлюднює адресу
        або інформацію про точне місце свого розташування.
      </p>

      <p> 4. Цілі обробки персональних даних.</p>

      <p>
        {" "}
        4.1. Мета обробки персональних даних Користувача – укладання, виконання
        та припинення цивільно-правових договорів, забезпечення реалізації
        господарських, податкових відносин, здійснення покладених на Оператора
        функцій, повноважень та обов’язків у відповідності до діючого
        законодавства України; ідентифікації клієнта як Користувача
        Інтернет-магазину, для зв’язку з Користувачем в тому числі для надання
        послуг, обробки платежів, відправки товарів, проведення розрахункових
        операцій, надання звітності, ведення бухгалтерського та управлінського
        обліку, створення і реалізації бонусних програм, програм лояльності,
        відправки розсилок поштою, електронною поштою, за номером телефону, в
        тому числі з метою відправки комерційних пропозицій, повідомлень про
        акції та новини Інтернет-магазину.
      </p>

      <p>
        {" "}
        4.2. Також Оператор має право надсилати Користувачеві повідомлення про
        нові продукти та послуги, спеціальні пропозиції та різні події.
        Користувач завжди може відмовитися від отримання інформаційних
        повідомлень, надіславши Оператору листа на адресу електронної пошти
        privacy@pyvnagavan.com з позначкою «Відмова від повідомлень про нові
        продукти та послуги та спеціальні пропозиції».
      </p>

      <p>
        {" "}
        4.3. Знеособлені дані Користувачів, які збираються за допомогою сервісів
        інтернет-статистики, служать для збору інформації про дії Користувачів
        на сайті, покращення якості сайту та його змісту.
      </p>

      <p> 5. Правові основи обробки персональних даних.</p>

      <p>
        {" "}
        5.1. Оператор обробляє персональні дані Користувача у разі їх заповнення
        та/або відправлення Користувачем самостійно через спеціальні форми,
        розташовані на Сайті. Заповнюючи відповідні форми та/або надсилаючи свої
        персональні дані Оператору (в тому числі через форму зворотнього
        зв’язку), Користувач висловлює свою згоду з цим Положенням та на надає
        свою згоду на обробку персональних даних, що надаються.
      </p>

      <p>
        {" "}
        5.2. Оператор обробляє знеособлені дані про Користувача у випадку, якщо
        це дозволено в налаштуваннях браузера Користувача (включено збереження
        файлів cookie та використання технології JavaScript).
      </p>

      <p>
        {" "}
        6. Порядок збирання, зберігання, передачі та інших видів обробки
        персональних даних.
      </p>

      <p>
        {" "}
        6.1. Безпека персональних даних, що обробляються Оператором,
        забезпечується шляхом реалізації правових, організаційних та технічних
        заходів, необхідних для виконання у повному обсязі вимог чинного
        законодавства у сфері захисту персональних даних.
      </p>

      <p>
        {" "}
        6.2. Оператор забезпечує збереження персональних даних та вживає всіх
        можливих заходів, що виключають доступ до персональних даних
        неуповноважених осіб.
      </p>

      <p>
        {" "}
        6.3. У разі виявлення неточностей у персональних даних, Користувач може
        актуалізувати їх самостійно шляхом надсилання Оператору повідомлення на
        адресу електронної пошти Оператора privacy@pyvnagavan.com з позначкою
        «Актуалізація персональних даних».
      </p>

      <p>
        {" "}
        6.4. Термін обробки персональних даних є необмеженим. Користувач може
        будь-якої миті відкликати свою згоду на обробку персональних даних,
        надіславши Оператору повідомлення за допомогою електронної пошти на
        електронну адресу Оператора privacy@pyvnagavan.com з позначкою
        «Відкликання згоди на обробку персональних даних».
      </p>

      <p>
        {" "}
        6.5. Оператор може здійснювати обмін Персональними даними з
        афілійованими особами Оператора, які можуть обробляти та використовувати
        дані з метою, визначеною цим Положенням. 6.6. Розкриття даних
        відбувається при замовленні Користувачем товарів/послуг в
        Інтернет-магазині в об’ємі необхідному для ідентифікації Користувача,
        виконання та опрацювання замовлення Користувача.{" "}
      </p>

      <p>
        {" "}
        6.7. Оператор може залучати сторонніх постачальників товарів/послуг для
        виконання замовлення, в таких випадках такі сторонні постачальники
        товарів/послуг не мають повноважень використовувати отримані за
        допомогою Сайту персональні дані, інакше ніж для виконання замовлення.
      </p>

      <p> 7. Заключні положення.</p>

      <p>
        {" "}
        7.1. Користувач може отримати будь-які роз'яснення щодо питань, що
        стосуються обробки його персональних даних, звернувшись до Оператора за
        допомогою електронної пошти privacy@pyvnagavan.com.
      </p>

      <p>
        {" "}
        7.2. У цьому документі буде відображено будь-які зміни Положення
        Оператором. Положення діє безстроково до заміни її новою версією.
      </p>
      <button onClick={history.goBack}>Повернутися назад</button>
    </div>
  );
}
